In [43]:
# Import libraries
import mysql.connector
from mysql.connector import Error
import pandas as pd

In [44]:
def create_server_connection(host_name, user_name, user_password):
    connection = None
    try:
        connection = mysql.connector.connect(
            host=host_name, user=user_name, passwd=user_password
        )
        print("MySQL Database connection successful")
    except Error as err:
        print(f"Error: {err}")
    return connection


# Database name
db = "mysql_python"
connection = create_server_connection("localhost", "root", None)

MySQL Database connection successful

In [45]:
# Create mysql_python
def create_database(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print("Database created successfully")
    except Error as err:
        print(f"Error: {err}")


create_database_query = f"CREATE DATABASE {db}"
create_database(connection, create_database_query)

Error: 1007 (HY000): Can't create database 'mysql_python'; database exists

In [46]:
# Connect to database
def create_db_connection(host_name, user_name, user_password, db_name):
    connection = None
    try:
        connection = mysql.connector.connect(
            host=host_name, user=user_name, passwd=user_password, database=db_name
        )
        print("MySQL database connection successful")
    except Error as err:
        print(f"Error: {err}")
    return connection

In [47]:
# Execute sql queries
def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query was successful")
    except Error as err:
        print(f"Error: {err}")

In [48]:
create_orders_table = """
CREATE TABLE orders(
	order_id INT AUTO_INCREMENT, 
	customer_name VARCHAR(30) NOT NULL, 
	product_name VARCHAR(20) NOT NULL, 
	date_ordered DATE, 
	quantity INT, 
	unit_price FLOAT, 
	phone_number VARCHAR(20),
	PRIMARY KEY (order_id)
	);
"""
# Connect to the database
connection = create_db_connection("localhost", "root", None, db)
execute_query(connection, create_orders_table)

MySQL database connection successful
Error: 1050 (42S01): Table 'orders' already exists

In [49]:
# Insert data
data_orders = """
INSERT INTO orders 
(customer_name, product_name, date_ordered, quantity, unit_price, phone_number)
VALUES 
('Steve', 'Laptop', '2018-06-12', 2, 800, '6293730802'),
('David', 'Books', '2019-12-25', 10, 12, '8367489124'),
('Mark', 'Trousers', '2018-03-14', 5, 30, '7368145099'),
('DeVasto', 'Headphones', '2019-05-30', 7, 48, '8865316698'),
('Ham', 'Smart TV', '2018-08-20', 10, 300, '7720130449');
"""
# Connect to the database
connection = create_db_connection("localhost", "root", None, db)
execute_query(connection, data_orders)

MySQL database connection successful
Query was successful

In [50]:
def read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as err:
        print(f"Error: {err}")

In [51]:
# Using the select stmt
q1 = """
SELECT * FROM orders;
"""
connection = create_db_connection("localhost", "root", None, db)
results = read_query(connection, q1)
for res in results:
    print(res)

MySQL database connection successful
(1, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 48.0, '6293730802')
(2, 'David', 'Books', datetime.date(2019, 12, 25), 10, 12.0, '8367489124')
(3, 'Mark', 'Trousers', datetime.date(2018, 3, 14), 5, 30.0, '7368145099')
(4, 'DeVasto', 'Headphones', datetime.date(2019, 5, 30), 7, 48.0, '8865316698')
(6, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '6293730802')
(7, 'David', 'Books', datetime.date(2019, 12, 25), 10, 12.0, '8367489124')
(8, 'Mark', 'Trousers', datetime.date(2018, 3, 14), 5, 30.0, '7368145099')
(9, 'DeVasto', 'Headphones', datetime.date(2019, 5, 30), 7, 48.0, '8865316698')
(10, 'Ham', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '7720130449')

In [52]:
q2 = """
SELECT customer_name, phone_number FROM orders;
"""
connection = create_db_connection("localhost", "root", None, db)
results = read_query(connection, q2)
for res in results:
    print(res)

MySQL database connection successful
('Steve', '6293730802')
('David', '8367489124')
('Mark', '7368145099')
('DeVasto', '8865316698')
('Steve', '6293730802')
('David', '8367489124')
('Mark', '7368145099')
('DeVasto', '8865316698')
('Ham', '7720130449')

In [53]:
q3 = """
SELECT DISTINCT year(date_ordered) FROM orders;
"""
connection = create_db_connection("localhost", "root", None, db)
results = read_query(connection, q3)
for res in results:
    print(res)

MySQL database connection successful
(2018,)
(2019,)

In [54]:
q4 = """
SELECT * FROM orders WHERE date_ordered < '2018-12-31';
"""
connection = create_db_connection("localhost", "root", None, db)
results = read_query(connection, q4)
for res in results:
    print(res)

MySQL database connection successful
(1, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 48.0, '6293730802')
(3, 'Mark', 'Trousers', datetime.date(2018, 3, 14), 5, 30.0, '7368145099')
(6, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '6293730802')
(8, 'Mark', 'Trousers', datetime.date(2018, 3, 14), 5, 30.0, '7368145099')
(10, 'Ham', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '7720130449')

In [55]:
from_db = []

for res in results:
    res = list(res)
    from_db.append(res)
columns = [
    "order_id",
    "customer_name",
    "product_name",
    "date_ordered",
    "quantity",
    "unit_price",
    "phone_number",
]
df = pd.DataFrame(from_db, columns=columns)
display(df)

,order_id,customer_name,product_name,date_ordered,quantity,unit_price,phone_number
0,1,Steve,Laptop,2018-06-12,2,48.0,6293730802
1,3,Mark,Trousers,2018-03-14,5,30.0,7368145099
2,6,Steve,Laptop,2018-06-12,2,800.0,6293730802
3,8,Mark,Trousers,2018-03-14,5,30.0,7368145099
4,10,Ham,Smart TV,2018-08-20,10,300.0,7720130449

In [56]:
# Update command

update = """
UPDATE orders
SET unit_price = 48
WHERE order_id = 1;
"""
connection = create_db_connection("localhost", "root", None, db)
execute_query(connection, update)

MySQL database connection successful
Query was successful

In [57]:
# Using the select stmt
q5 = """
SELECT unit_price FROM orders WHERE order_id = 1;
"""
connection = create_db_connection("localhost", "root", None, db)
results = read_query(connection, q5)
for res in results:
    print(res)

MySQL database connection successful
(48.0,)

In [58]:
# Delete command

delete_order = """
DELETE FROM orders WHERE order_id = 5;
"""
connection = create_db_connection("localhost", "root", None, db)
execute_query(connection, delete_order)

MySQL database connection successful
Query was successful

In [59]:
q6 = """
SELECT * FROM orders;
"""
connection = create_db_connection("localhost", "root", None, db)
results = read_query(connection, q6)
for res in results:
    print(res)

MySQL database connection successful
(1, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 48.0, '6293730802')
(2, 'David', 'Books', datetime.date(2019, 12, 25), 10, 12.0, '8367489124')
(3, 'Mark', 'Trousers', datetime.date(2018, 3, 14), 5, 30.0, '7368145099')
(4, 'DeVasto', 'Headphones', datetime.date(2019, 5, 30), 7, 48.0, '8865316698')
(6, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '6293730802')
(7, 'David', 'Books', datetime.date(2019, 12, 25), 10, 12.0, '8367489124')
(8, 'Mark', 'Trousers', datetime.date(2018, 3, 14), 5, 30.0, '7368145099')
(9, 'DeVasto', 'Headphones', datetime.date(2019, 5, 30), 7, 48.0, '8865316698')
(10, 'Ham', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '7720130449')